<!--
    1、组件定义 Vue.component('comp', { template: `` })  vue-loader会编译template为render函数，最终导出的依然是组件配置对象
    2、组件化优点
        2.1、组件是独立可复用的代码组织单元，组件系统是vue核心特性之一，它使开发者使用小型独立和通常可复用的组件构建大型应用
        2.2、组件化开发能大幅提高开发效率、测试性、复用性
        2.3、组件使用按分类有：页面组件、页面组件、通用组件
        2.4、vue的组件是基于配置的，通常编写的组件是组件配置而非组件，框架后续会生成其构造函数，它们是基于VueComponent拓展于vue
        2.5、vue常见的组件化技术有：属性prop、自定义事件、插槽等，它们主要用于组件通信、拓展
        2.6、合理的划分组件，有助于提升应用性能
        2.7、组件应该是高内聚、低耦合
        2.8、遵循单项数据流原则
    3、组件化实现：构造函数、实例化、挂载
-->
<template>
  <div>
    <h1>vue组件化</h1>
  </div>
</template>

<script>
export default {

}

</script>
<style>
</style>