<!--
    1、渐进式JavaScript框架：自底向上逐层应用，vue的核心只关注视图层，不仅易于上手，还便于与第三方库或既有项目整合；与现代化工具链以及各种支持类库结合使用时vue也完全能够为复杂的单页面应用提供驱动
    2、易用、灵活、高效：
        2.1、vue提供数据响应式、声明式模板语法和基于配置的组件系统等核心特性。使得我们只需要关注应用的核心业务即可，只要会写js、html和css就能轻松编写vue应用
        2.2、渐进式框架最大优点就是灵活性，如果应用足够小，我们可能仅仅需要vue核心特性即可完成功能；随着应用规模不断扩大，我们才可能逐渐引入路由、状态管理、vue-cli等库和工具，不管是应用体积还是学习难度都是一个逐渐增加的平和曲线。
        2.3、超快的虚拟DOM和diff算法使得我们的应用拥有最佳的性能表现。追求高效的过程还在继续，vue3中引入proxy对数据响应式改进以及编译器中对于静态内容的改进都会让vue更加高效。
-->
<template>
  <div>
    <h1>vue设计原则</h1>
  </div>
</template>

<script>
export default {

}

</script>
<style>
</style>